cool/tutorials/surfaceTracking/interTrackFoam/ramp/constant/faMesh/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// ************************************************************************** //

polyMeshPatches  1( freeSurface );

boundary
{
    inlet
    {
        type                patch;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  inlet;
    }

    outlet
    {
        type                patch;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  outlet;
    }

    frontAndBack
    {
        type                empty;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  frontAndBack;
    }
}

// ************************************************************************** //
