cool/tutorials/surfaceTracking/interTrackFoam/ramp/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    ddt(rho,U) Euler;
}

gradSchemes
{
    default Gauss linear;
    grad(p) Gauss linear;
}

divSchemes
{
    div(phi,U) Gauss GammaVDC 0.5;
    div(phiNet,U) Gauss GammaVDC 0.5;
}

laplacianSchemes
{
    default none;
    laplacian(mu,U) Gauss linear corrected;
    laplacian((1|A(U)),p) Gauss linear corrected;
    laplacian((1|interpolate(A(U))),p) Gauss linear corrected;
}

interpolationSchemes
{
    default linear;
    interpolate(HbyA) linear;
}

snGradSchemes
{
    default corrected;
}

fluxRequired
{
    p                   0;
}

// ************************************************************************* //
